backend/controllers/RepairController.php

SELECT * FROM `status` WHERE `status`=1
---

        //$allStatus = ArrayHelper::map($modelStatus->getAllStatus(),'id_status','statusDesc');

        $allStatus = status::find()->where(['status'=>1])->asArray()->all();

SELECT * FROM `status` WHERE (`status`=1) AND (NOT (`id_status`=6))
---

        //$allStatus = ArrayHelper::map($modelStatus->getAllStatus(),'id_status','statusDesc');

        $allStatus = status::find()->where(['status'=>1])->andWhere(['not',['id_status'=>6]])->asArray()->all();

SELECT * FROM `status` WHERE `status`=1
---
            $modelModels = $modelModels->findOne($modelInv->model_id);

            //status
            $modelStatus = $modelStatus->findOne($modelRepair->status_id);

SELECT * FROM `repair` WHERE `id_repair`='21'
---
    public function actionRecoverajax(){
        if (isset($_POST['list']) && $_POST['list']!=""){
            $listarray = $_POST['list'];

            //removes all projects
            foreach($listarray as $repair){
                $obj = repair::find()->where(['id_repair'=>$repair])->one();