backend/controllers/SiteController.php

SELECT `groups`.`type` FROM `groups` INNER JOIN `user` ON user.group_id = groups.id_group WHERE `user`.`id_users`=1
SELECT * FROM `user` WHERE `id_users`=1
---
    public function actionLogin()
    {

        if (!\Yii::$app->user->isGuest) {
            return $this->goHome();
        }

        $model = new LoginForm();
        if ($model->load(Yii::$app->request->post()) && $model->login()) {
            $userInfo = Groups::find()->select('groups.type')->innerJoin('user','user.group_id = groups.id_group')->where(['user.id_users'=>Yii::$app->user->getId()])->one();
            $user = User::find()->where(['id_users'=>Yii::$app->user->getId()])->one();