common/models/Accessories.php

SELECT * FROM `accessories` WHERE status=1 ORDER BY `accessDesc`
---
    public function getAllAccess(){
        return $this->find()->asArray()->orderBy('accessDesc ASC')->all();