common/models/RepairType.php

    public function getAllTypes(){
        return $this->find()->asArray()->orderBy('typeDesc ASC')->all();
---
SELECT * FROM `repair_type` ORDER BY `typeDesc`