common/models/Repair.php

    public function getStatusDesc(){
        return Status::find()->joinWith("repairs")->where(['status.id_status'=>$this->status_id])->asArray()->one();
---
SELECT `status`.* FROM `status` LEFT JOIN `repair` ON `status`.`id_status` = `repair`.`status_id` WHERE `status`.`id_status`=6

    public function getStoreDesc($id){
      //return $this->store_id;
      return Stores::find()->joinWith("repairs")->where(['repair.id_repair'=>$id])->asArray()->one();
---
SELECT `stores`.* FROM `stores` LEFT JOIN `repair` ON `stores`.`id_store` = `repair`.`store_id` WHERE `repair`.`id_repair`=21

    public function getThisAccess($id){
        $accessories = RepairAccessory::find()->select('accessory_id')->where(['repair_id' => $id])->asArray()->all();
---
SELECT `accessory_id` FROM `repair_accessory` WHERE `repair_id`=21

    static function getThisAccessAll($id){
        $accessories = RepairAccessory::find()->joinWith('accessory')->where(['repair_id' => $id])->asArray()->all();
---
SELECT `repair_accessory`.* FROM `repair_accessory` LEFT JOIN `accessories` ON `repair_accessory`.`accessory_id` = `accessories`.`id_accessories` WHERE `repair_id`=21

    public function getThisOtherDesc($id){
        $desc = RepairAccessory::find()->select('repair_accessory.otherDesc')->innerJoin('accessories','repair_accessory.accessory_id = accessories.id_accessories')->where(['accessories.accessType' => 2,'repair_accessory.repair_id' => $id])->one();
---
SELECT `repair_accessory`.`otherDesc` FROM `repair_accessory` INNER JOIN `accessories` ON repair_accessory.accessory_id = accessories.id_accessories WHERE (`accessories`.`accessType`=2) AND (`repair_accessory`.`repair_id`=21)

    public function getThisParts($id){
        $parts = RepairParts::find()->joinWith('part')->where(['repair_id' => $id,'parts.status'=> 1])->all();
---
SELECT `repair_parts`.* FROM `repair_parts` LEFT JOIN `parts` ON `repair_parts`.`part_id` = `parts`.`id_part` WHERE (`repair_id`=21) AND (`parts`.`status`=1)

    public function getEquipName(){
        return Equipaments::find()->joinWith("inventories")->where(['inventory.id_inve'=>$this->inve_id])->asArray()->one();
---
SELECT `equipaments`.* FROM `equipaments` LEFT JOIN `inventory` ON `equipaments`.`id_equip` = `inventory`.`equip_id` WHERE `inventory`.`id_inve`=36

    public function getModelName(){
        return Models::find()->joinWith("inventories")->where(['inventory.id_inve'=>$this->inve_id])->asArray()->one();
---
SELECT `models`.* FROM `models` LEFT JOIN `inventory` ON `models`.`id_model` = `inventory`.`model_id` WHERE `inventory`.`id_inve`=36