common/models/Stores.php

SELECT * FROM `stores` WHERE `status`=1 ORDER BY `storeDesc`
---
    public function getAllStores(){
        return $this->find()->where(['status'=>1])->asArray()->orderBy('storeDesc ASC')->all();