common/models/User.php

SELECT * FROM `user` WHERE (`id_users`=8) AND (`status`=1)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id_users' => $id, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `user` WHERE (`username`='admin') AND (`status`=1)
---
    public static function findByUsername($username)
    {
        //return static::findOne(['userMail' => $username, 'status' => self::STATUS_ACTIVE]);
        return static::findOne(['username' => $username,'status'=>1,]);