frontend/models/SignupForm.php

    public function signup()
    {

            if ($this->validate()) {
                $user = new User();
                $user->username = $this->username;
                $user->email = $this->email;
                $user->setPassword($this->password);
                $user->generateAuthKey();
                $user->save();
---
INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `role`, `group_id`, `status`, `created_at`, `updated_at`) VALUES ('sadf', 'asdf@lkajsd.com', '$2y$13$7L.jy0V/nW8x.iaA7lG6Mul/bOINd/9IDBxFcJ6BjbGTRThBriF5e', 'W6JBKgOSp1eSTwnq2ry5iQs7Flqg45qd', 50, 1, 1, '2014-11-12 21:06:57', '2014-11-12 21:06:57')